app/views/claims/_form.html.erb

              <label class="phx-form-control-label" for="claim_display_name">Customer</label>
              <input class="phx-form-control" value="<%= Customer.find(@claim.customer_id).display_name if @claim.customer_id %>" name="claim[claim_display_name]" id="claim_display_name" type="text" readonly>
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1  ORDER BY last_name ASC LIMIT 1  [["id", 650]]

                <% prescriber_id = -1 %>
                <% prescriber_id = Prescription.find(@claim.prescription_id).prescriber_id if @claim.prescription_id %>
---
SELECT  "prescribers".* FROM "prescribers" WHERE "prescribers"."id" = $1  ORDER BY last_name ASC LIMIT 1  [["id", 5928]]
SELECT  "prescriptions".* FROM "prescriptions" WHERE "prescriptions"."id" = $1 LIMIT 1  [["id", nil]]

                <label class="phx-form-control-label" for="claim_payment_type">Payment Type</label>
                <input class="phx-form-control" value="<%= Plan.find(@claim.plan_id).plan_type if @claim.plan_id  %>" name="claim[claim_payment_type]" id="claim_payment_type" type="text" readonly>
---
SELECT  "plans".* FROM "plans" WHERE "plans"."id" = $1 LIMIT 1  [["id", nil]]

                        <label class="phx-form-control-label" for="claim_error_text">Error  Text</label>
                        <% claim_error = ClaimError.find_by error_type:1, error_code:@claim.reject_code %>
---
SELECT  "claim_errors".* FROM "claim_errors" WHERE "claim_errors"."error_type" = $1 AND "claim_errors"."error_code" IS NULL LIMIT 1  [["error_type", 1]]