app/views/customers/_form.html.erb

                          <% i = 0 %>
                          <% @customer.customerPlans.order(:sequence_number, :id).each do |f| %>
---
SELECT "customer_plans".* FROM "customer_plans" WHERE "customer_plans"."customer_id" = $1  ORDER BY "customer_plans"."sequence_number" ASC, "customer_plans"."id" ASC  [["customer_id", 1]]