app/controllers/accounts_controller.rb

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."account_number" = $1  ORDER BY "accounts"."id" ASC LIMIT 1  [["account_number", 1142]]
---
  def show_by_account_number
    @account = Account.where({account_number: params[:id].to_i}).first