app/controllers/customers_controller.rb

    def show
      @sub_index = params[:sub_index]
      @tab_index = params[:tab_index]
      if @sub_index.to_i == -1
        @plan_id_code = params[:plan_id_code]
        @plan_type = Plan.where('plan_id_code=' + @plan_id_code.to_s).first.plan_type
---
SELECT  "plans".* FROM "plans" WHERE (plan_id_code = 225)  ORDER BY "plans"."id" ASC LIMIT 1

    def set_customer
      @customer = Customer.find(params[:id])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1  ORDER BY last_name ASC LIMIT 1  [["id", 1]]