app/controllers/pharmacies_controller.rb

SELECT  "pharmacies".* FROM "pharmacies" WHERE "pharmacies"."id" = $1 LIMIT 1  [["id", 1]]
---
  def new
#    @pharmacy = Pharmacy.find 1
      # TESTING: start with the 1st pharmacy
      @pharmacy = Pharmacy.find 1