app/controllers/plans_controller.rb

SELECT "plans".* FROM "plans" WHERE (insurance_plan_name like '%')
---
  def search
    bin_number = params[:bin_number]
    plan_name  = params[:insurance_plan_name]
    pageNumber = params[:page] ? params[:page] : 1
    perPage = 9
    @searchPlans = Plan.search_plan(plan_name, bin_number).page(pageNumber).per(perPage)