app/controllers/prescriptions_controller.rb

    def refreshSigCache
        sigCache = Sigcode.all
---
SELECT "sigcodes".* FROM "sigcodes"