app/controllers/user_sessions_controller.rb

  def create

#	user = User.find_by_initials(params[:initials])
	user = User.find_by_username(params[:initials])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT 1  [["username", "Steve"]]