app/views/common/search/_customer_search_modal_template.html.erb

SELECT  "customers".* FROM "customers" WHERE (last_name like '%') AND (active is TRUE)  ORDER BY last_name ASC LIMIT 9 OFFSET 0
SELECT COUNT(*) FROM "customers" WHERE (last_name like '%') AND (active is TRUE)
---
			<div class="modal-footer">
				<%=	paginate searchCustomers,
						params: { controller: (searchController.nil? ? "customers" : searchController),
							 				action: "nextCustomers"} , remote: true  unless searchCustomers.empty? %>