app/views/common/search/_item_search_modal_template.html.erb

SELECT  "items".* FROM "items" WHERE (item_name LIKE 'A%') LIMIT 9 OFFSET 0
SELECT COUNT(*) FROM "items" WHERE (item_name LIKE 'A%')
---
			<div class="modal-footer">
				<%=	paginate searchItems,
						params: { controller: (searchController.nil? ? "items" : searchController),
							 				action: "nextItems"} , remote: true  unless searchItems.empty? %>